#include <stdlib.h> //filenameในการใช้function system()
#include <stdio.h> //filenameในการใช้function I/O Function

int main() {
    char input; //ประกาศตัวแปรเป็นcharecter
    for (;input != 65;) { //วนลูปในการใส่คีย์เสียงเปียโน และออกลูปเมื่อคลิกอักษรตัว q
        printf("-------------------------------------------------\n"); //รูปแบบของเปียโนในการแสดงบนจอoutputบนterminal
        printf("|   |   | |   |   |   |   | |   | |   |   |     |\n");
        printf("|   | 1 | | 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
        printf("|   |   | |   |   |   |   | |   | |   |   |     |\n");
        printf("|   |   | |   |   |   |   | |   | |   |   |     |\n");
        printf("|   ----- -----   |   ----- ----- -----   |     |\n");
        printf("|     |     |     |     |     |     |     |     |\n");
        printf("|     |     |     |     |     |     |     |     |\n");
        printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
        printf("|     |     |     |     |     |     |     |     |\n");
        printf("|     |     |     |     |     |     |     |     |\n");
        printf("|     |     |     |     |     |     |     |     |\n");
        printf("-------------------------------------------------\n");
        system("/bin/stty raw"); //ใช้ในการ นําคีย์ที่inputมาใช้งาน โดยไม่ผ่านการenter
        input = getchar() - '0'; //กำหนดตัวแปลในการรับค่าascii
        system("stty cooked"); //ทำให้terminalกลับสู่โหมดปกติ
        system("clear"); //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
        switch(input){ //รับค่าinputเข้าswitchcase
            case 1: //case ที่inputเป็น1
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   ||||| |   |   |   |   | |   | |   |   |     |\n");
                printf("|   ||1|| | 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   ||||| |   |   |   |   | |   | |   |   |     |\n");
                printf("|   ||||| |   |   |   |   | |   | |   |   |     |\n");
                printf("|   ----- -----   |   ----- ----- -----   |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound1.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 2: //case ที่inputเป็น2
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |||||   |   |   | |   | |   |   |     |\n");
                printf("|   | 1 | ||2||   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   | |||||   |   |   | |   | |   |   |     |\n");
                printf("|   |   | |||||   |   |   | |   | |   |   |     |\n");
                printf("|   ----- -----   |   ----- ----- -----   |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound2.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 3: //case ที่inputเป็น3
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   ||||| |   | |   |   |     |\n");
                printf("|   | 1 | | 2 |   |   ||3|| | 4 | | 5 |   |     |\n");
                printf("|   |   | |   |   |   ||||| |   | |   |   |     |\n");
                printf("|   |   | |   |   |   ||||| |   | |   |   |     |\n");
                printf("|   ----- -----   |   ----- ----- -----   |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound3.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 4: //case ที่inputเป็น4
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | ||||| |   |   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | ||4|| | 5 |   |     |\n");
                printf("|   |   | |   |   |   |   | ||||| |   |   |     |\n");
                printf("|   |   | |   |   |   |   | ||||| |   |   |     |\n");
                printf("|   ----- -----   |   ----- ----- -----   |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound4.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 5: //case ที่inputเป็น5
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   | |||||   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 | ||5||   |     |\n");
                printf("|   |   | |   |   |   |   | |   | |||||   |     |\n");
                printf("|   |   | |   |   |   |   | |   | |||||   |     |\n");
                printf("|   ----- -----   |   ----- ----- -----   |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("|     |     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound5.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 20: //case ที่inputเป็นD
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("||||| 1 | | 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("||||----- -----   |   ----- ----- -----   |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||D|||  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound6.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 52: //case ที่inputเป็นd
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("||||| 1 | | 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("|||||   | |   |   |   |   | |   | |   |   |     |\n");
                printf("||||----- -----   |   ----- ----- -----   |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||D|||  R  |  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("|||||||     |     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound6.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 34: //case ที่inputเป็นR
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   | 1 ||| 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   -----|-----   |   ----- ----- -----   |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|  D  |||R|||  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound7.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 66: //case ที่inputเป็นr
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   | 1 ||| 2 |   |   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   |   |||   |   |   |   | |   | |   |   |     |\n");
                printf("|   -----|-----   |   ----- ----- -----   |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|  D  |||R|||  M  |  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("|     |||||||     |     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound7.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 29: //case ที่inputเป็นM
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   | 1 | | 2 |||||   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   ----- -----||||   ----- ----- -----   |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|  D  |  R  |||M|||  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound8.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 61: //case ที่inputเป็นm
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   | 1 | | 2 |||||   | 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   |   | |   |||||   |   | |   | |   |   |     |\n");
                printf("|   ----- -----||||   ----- ----- -----   |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|  D  |  R  |||M|||  F  |  S  |  L  |  T  |  8  |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("|     |     |||||||     |     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound8.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 22: //case ที่inputเป็นF
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   | 1 | | 2 |   ||||| 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   ----- -----   ||||----- ----- -----   |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|  D  |  R  |  M  |||F|||  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound9.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 54: //case ที่inputเป็นf
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   | 1 | | 2 |   ||||| 3 | | 4 | | 5 |   |     |\n");
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   |   | |   |   |||||   | |   | |   |   |     |\n");
                printf("|   ----- -----   ||||----- ----- -----   |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|  D  |  R  |  M  |||F|||  S  |  L  |  T  |  8  |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("|     |     |     |||||||     |     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound9.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 35: //case ที่inputเป็นS
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 ||| 4 | | 5 |   |     |\n");
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   ----- -----   |   -----|----- -----   |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |||S|||  L  |  T  |  8  |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound10.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 67: //case ที่inputเป็นs
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 ||| 4 | | 5 |   |     |\n");
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   |   | |   |   |   |   |||   | |   |   |     |\n");
                printf("|   ----- -----   |   -----|----- -----   |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|  D  |  R  |  M  |  F  |||S|||  L  |  T  |  8  |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("|     |     |     |     |||||||     |     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound10.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 28: //case ที่inputเป็นL
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 ||| 5 |   |     |\n");
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   ----- -----   |   ----- -----|-----   |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |||L|||  T  |  8  |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound11.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 60: //case ที่inputเป็นl
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 ||| 5 |   |     |\n");
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   |   | |   |   |   |   | |   |||   |   |     |\n");
                printf("|   ----- -----   |   ----- -----|-----   |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |||L|||  T  |  8  |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("|     |     |     |     |     |||||||     |     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound11.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 36: //case ที่inputเป็นT
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 | | 5 |||||     |\n");
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   ----- -----   |   ----- ----- -----||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |||T|||  8  |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound12.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 68: //case ที่inputเป็นt
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 | | 5 |||||     |\n");
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   |   | |   |   |   |   | |   | |   |||||     |\n");
                printf("|   ----- -----   |   ----- ----- -----||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |||T|||  8  |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("|     |     |     |     |     |     |||||||     |\n");
                printf("-------------------------------------------------\n");
                system("afplay sound12.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
            case 8: //case ที่inputเป็น8
                printf("-------------------------------------------------\n"); //รูปแบบของคีย์เปียโนที่inputในการแสดงบนterminal
                printf("|   |   | |   |   |   |   | |   | |   |   |||||||\n");
                printf("|   | 1 | | 2 |   |   | 3 | | 4 | | 5 |   |||||||\n");
                printf("|   |   | |   |   |   |   | |   | |   |   |||||||\n");
                printf("|   |   | |   |   |   |   | |   | |   |   |||||||\n");
                printf("|   ----- -----   |   ----- ----- -----   |||||||\n");
                printf("|     |     |     |     |     |     |     |||||||\n");
                printf("|     |     |     |     |     |     |     |||||||\n");
                printf("|  D  |  R  |  M  |  F  |  S  |  L  |  T  |||8|||\n");
                printf("|     |     |     |     |     |     |     |||||||\n");
                printf("|     |     |     |     |     |     |     |||||||\n");
                printf("|     |     |     |     |     |     |     |||||||\n");
                printf("-------------------------------------------------\n");
                system("afplay sound13.mov"); //เรียกไฟล์เสียงในการแสดงoutput
                system("clear");  //clearรูปแบบของเปียโนออก เพื่อแสดงผลของคีย์ที่inputต่อไป
                break; //breakการทำงานของswitch case
        }
    }
    return 0;
}